/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   rev.c                                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tfujikaw <tfujikaw@student.42tokyo.jp      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/04/08 15:07:44 by tfujikaw          #+#    #+#             */
/*   Updated: 2026/04/08 15:16:12 by tfujikaw         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <unistd.h>

int main(int argc, char **argv)
{
	int	i;

	i = 0;
	if (argc != 2)
	{
		write(1, "\n", 1);
		return (0);
	}
	while (argv[1][i])
	{
		i++;
	}
	i--; // ここで逆順になった時、ヌル文字を避けた後に処理に入る
	while (i >= 0)
	{
		write(1, &argv[1][i], 1);	
		i--;
	}
	write (1, "\n", 1);
	return 0;
}
