/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   test1.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tfujikaw <tfujikaw@student.42tokyo.jp      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/03/26 08:43:35 by tfujikaw          #+#    #+#             */
/*   Updated: 2026/03/26 09:41:15 by tfujikaw         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

int	main(void)
{
	//char	s1[] = "";
	char	s1[] = "aiueo";
	int		i = 4;
	if (!s1[i])
		printf("NULLだよ");
	else if (s1[i])
		printf("NULLじゃないよ");
	return 0;
}
